MontesW/en-525-615-82-lab4/reference/ili9341-dev/workspace/WB55-Nucleo-ili9341/Core/Src/stm32wbxx_nucleo_bsp.c

/**
 ******************************************************************************
 * @file    stm32wbxx_nucleo.c
 * @author  MCD Application Team
 * @brief   This file provides set of firmware functions to manage:
 *          - LEDs and push-button available on STM32WBXX-Nucleo Kit
 *            from STMicroelectronics
 *          - LCD, joystick and microSD available on Adafruit 1.8" TFT LCD
 *            shield (reference ID 802)
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32wbxx_nucleo_bsp.h"

/** @addtogroup BSP
 * @{
 */

/** @defgroup STM32WBXX_NUCLEO STM32WBxx-Nucleo
 * @brief This file provides set of firmware functions to manage Leds and
 * push-button available on STM32WBxx-Nucleo Kit from STMicroelectronics. It
 * provides also LCD, joystick and uSD functions to communicate with
 *        Adafruit 1.8" TFT LCD shield (reference ID 802)
 * @{
 */

/** @defgroup STM32WBXX_NUCLEO_Private_Defines Private Defines
 * @{
 */

/**
 * @brief STM32WBxx NUCLEO BSP Driver
 */
#define __STM32WBxx_NUCLEO_BSP_VERSION_MAIN (0x01U)
/*< [31:24] main version */
#define __STM32WBxx_NUCLEO_BSP_VERSION_SUB1 (0x00U)
/*< [23:16] sub1 version */
#define __STM32WBxx_NUCLEO_BSP_VERSION_SUB2 (0x00U)
/*< [15:8]  sub2 version */
#define __STM32WBxx_NUCLEO_BSP_VERSION_RC (0x00U)
/*< [7:0]  release candidate */
#define __STM32WBxx_NUCLEO_BSP_VERSION           \
  ((__STM32WBxx_NUCLEO_BSP_VERSION_MAIN << 24) | \
   (__STM32WBxx_NUCLEO_BSP_VERSION_SUB1 << 16) | \
   (__STM32WBxx_NUCLEO_BSP_VERSION_SUB2 << 8) |  \
   (__STM32WBxx_NUCLEO_BSP_VERSION_RC))

/**
 * @brief LINK SD Card
 */
#define SD_DUMMY_BYTE 0xFF
#define SD_NO_RESPONSE_EXPECTED 0x80

/**
 * @}
 */

/** @defgroup STM32WBXX_NUCLEO_LOW_LEVEL_Private_Variables Private Variables
 * @{
 */
GPIO_TypeDef * GPIO_PORT[LEDn] = {LED1_GPIO_PORT, LED2_GPIO_PORT,
                                 LED3_GPIO_PORT};
const uint16_t GPIO_PIN[LEDn]  = {LED1_PIN, LED2_PIN, LED3_PIN};

GPIO_TypeDef *BUTTON_PORT[BUTTONn] = {
    BUTTON_SW1_GPIO_PORT, BUTTON_SW2_GPIO_PORT, BUTTON_SW3_GPIO_PORT};
const uint16_t BUTTON_PIN[BUTTONn]  = {BUTTON_SW1_PIN, BUTTON_SW2_PIN,
                                      BUTTON_SW3_PIN};
const uint8_t  BUTTON_IRQn[BUTTONn] = {
    BUTTON_SW1_EXTI_IRQn, BUTTON_SW2_EXTI_IRQn, BUTTON_SW3_EXTI_IRQn};

/**
 * @brief BUS variables
 */

#ifdef HAL_SPI_MODULE_ENABLED
uint32_t hnucleo_SpixTimeout =
    NUCLEO_SPIx_TIMEOUT_MAX; /*<! Value of Timeout when SPI communication fails
                              */
static SPI_HandleTypeDef hnucleo_Spi;
#endif /* HAL_SPI_MODULE_ENABLED */

#ifdef HAL_ADC_MODULE_ENABLED
static ADC_HandleTypeDef hnucleo_Adc;
/* ADC channel configuration structure declaration */
static ADC_ChannelConfTypeDef hnucleo_AdcChannelConfig;
#endif /* HAL_ADC_MODULE_ENABLED */

/**
 * @}
 */

/** @defgroup STM32WBXX_NUCLEO_Private_Functions Private Functions
 * @{
 */
#ifdef HAL_SPI_MODULE_ENABLED
static void SPIx_Init(void);
static void SPIx_Write(uint8_t Value);
static void SPIx_Error(void);
static void SPIx_MspInit(void);
#endif /* HAL_SPI_MODULE_ENABLED */

#ifdef HAL_ADC_MODULE_ENABLED
static HAL_StatusTypeDef ADCx_Init(void);
static void              ADCx_MspInit(ADC_HandleTypeDef *hadc);
#endif /* HAL_ADC_MODULE_ENABLED */

#ifdef HAL_SPI_MODULE_ENABLED
/* SD IO functions */
void    SD_IO_Init(void);
void    SD_IO_CSState(uint8_t state);
void    SD_IO_WriteReadData(const uint8_t *DataIn,
                            uint8_t *      DataOut,
                            uint16_t       DataLength);
uint8_t SD_IO_WriteByte(uint8_t Data);

#endif /* HAL_SPI_MODULE_ENABLED */
/**
 * @}
 */

/** @defgroup STM32WBXX_NUCLEO_Exported_Functions Exported Functions
 * @{
 */

/**
 * @brief  This method returns the STM32WBxx NUCLEO BSP Driver revision
 * @retval version: 0xXYZR (8bits for each decimal, R for RC)
 */
uint32_t BSP_GetVersion(void)
{
  return __STM32WBxx_NUCLEO_BSP_VERSION;
}

/** @defgroup STM32WBXX_NUCLEO_LED_Functions LED Functions
 * @{
 */

/**
 * @brief  Configures LED GPIO.
 * @param  Led: LED to be configured.
 *          This parameter can be one of the following values:
 *            @arg LED1
 *            @arg LED2
 *            @arg LED3
 * @retval None
 */
void BSP_LED_Init(Led_TypeDef Led)
{
  GPIO_InitTypeDef gpioinitstruct = {0};

  /* Enable the GPIO_LED Clock */
  LEDx_GPIO_CLK_ENABLE(Led);

  /* Configure the GPIO_LED pin */
  gpioinitstruct.Pin   = GPIO_PIN[Led];
  gpioinitstruct.Mode  = GPIO_MODE_OUTPUT_PP;
  gpioinitstruct.Pull  = GPIO_NOPULL;
  gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;

  HAL_GPIO_Init(GPIO_PORT[Led], &gpioinitstruct);

  HAL_GPIO_WritePin(GPIO_PORT[Led], GPIO_PIN[Led], GPIO_PIN_RESET);
}

/**
 * @brief  DeInit LEDs.
 * @param  Led: LED to be de-init.
 *   This parameter can be one of the following values:
 *     @arg  LED1
 *     @arg  LED2
 *     @arg  LED3
 * @note Led DeInit does not disable the GPIO clock nor disable the Mfx
 * @retval None
 */
void BSP_LED_DeInit(Led_TypeDef Led)
{
  GPIO_InitTypeDef gpio_init_structure;

  /* Turn off LED */
  HAL_GPIO_WritePin(GPIO_PORT[Led], GPIO_PIN[Led], GPIO_PIN_RESET);
  /* DeInit the GPIO_LED pin */
  gpio_init_structure.Pin = GPIO_PIN[Led];
  HAL_GPIO_DeInit(GPIO_PORT[Led], gpio_init_structure.Pin);
}

/**
 * @brief  Turns selected LED On.
 * @param  Led: Specifies the Led to be set on.
 *   This parameter can be one of following parameters:
 *     @arg LED1
 *     @arg LED2
 *     @arg LED3
 * @retval None
 */
void BSP_LED_On(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(GPIO_PORT[Led], GPIO_PIN[Led], GPIO_PIN_SET);
}

/**
 * @brief  Turns selected LED Off.
 * @param  Led: Specifies the Led to be set off.
 *   This parameter can be one of following parameters:
 *     @arg LED1
 *     @arg LED2
 *     @arg LED3
 * @retval None
 */
void BSP_LED_Off(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(GPIO_PORT[Led], GPIO_PIN[Led], GPIO_PIN_RESET);
}

/**
 * @brief  Toggles the selected LED.
 * @param  Led: Specifies the Led to be toggled.
 *   This parameter can be one of following parameters:
 *     @arg LED1
 *     @arg LED2
 *     @arg LED3
 * @retval None
 */
void BSP_LED_Toggle(Led_TypeDef Led)
{
  HAL_GPIO_TogglePin(GPIO_PORT[Led], GPIO_PIN[Led]);
}

/**
 * @}
 */

/** @defgroup STM32WBXX_NUCLEO_BUTTON_Functions BUTTON Functions
 * @{
 */

/**
 * @brief  Configures Button GPIO and EXTI Line.
 * @param  Button: Specifies the Button to be configured.
 *   This parameter can be one of following parameters:
 *     @arg BUTTON_SW1
 *     @arg BUTTON_SW2
 *     @arg BUTTON_SW3
 * @param  ButtonMode: Specifies Button mode.
 *   This parameter can be one of following parameters:
 *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO
 *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line with
 * interrupt generation capability
 * @retval None
 */
void BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  GPIO_InitTypeDef gpioinitstruct = {0};

  /* Enable the BUTTON Clock */
  BUTTONx_GPIO_CLK_ENABLE(Button);

